Revit 2027 API
ParameterTypeId.CouplerCode Property
 "Part Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerCode { get; }
Public Shared ReadOnly Property CouplerCode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerCode {
	ForgeTypeId^ get ();
}
static member CouplerCode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace